PeterVranken/DEVKIT-MPC5748G/samples/safe-RTOS/code/system/RTOS/rtos.h
#ifndef RTOS_INCLUDED
#define RTOS_INCLUDED
/**
 * @file rtos.h
 *
 * Public interface of safe-RTOS. The functions, which are published here as prototypes or
 * which are implemented here as inline functions, are intended for use. Most typical, an
 * operating system (sometimes called Basic Software) will be built on this interface.
 *
 * safe-RTOS application interface:
 *
 *   System configuration and initialization:
 *
 *     rtos_osCreateEventProcessor
 *     rtos_osCreateEvent (deprecated alias of rtos_osCreateEventProcessor)
 *     rtos_osCreateSwTriggeredEventProcessor
 *     rtos_osRegisterInitTask
 *     rtos_osRegisterUserTask
 *     rtos_osRegisterOSTask
 *     rtos_osInitINTCInterruptController
 *     rtos_osRegisterInterruptHandler
 *     rtos_osGrantPermissionRunTask
 *     rtos_osGrantPermissionSuspendProcess
 *     rtos_osInitKernel
 *
 *   Control tasks and processes:
 *
 *     rtos_osSendEvent
 *     rtos_osTriggerEvent (deprecated alias of rtos_osSendEvent)
 *     rtos_sendEvent (inline)
 *     rtos_triggerEvent (deprecated alias of rtos_sendEvent)
 *     rtos_osSendEventCountable
 *     rtos_sendEventCountable (inline)
 *     rtos_osSendEventMultiple
 *     rtos_sendEventMultiple (inline)
 *     rtos_osRunTask (inline)
 *     rtos_runTask (inline)
 *     rtos_terminateTask (inline)
 *     rtos_osSuspendProcess
 *     rtos_suspendProcess (inline)
 *
 *   Critical sections:
 *
 *     rtos_osSuspendAllInterrupts (inline)
 *     rtos_osResumeAllInterrupts (inline)
 *     rtos_osEnterCriticalSection (inline)
 *     rtos_osLeaveCriticalSection (inline)
 *     rtos_osSuspendAllTasksByPriority
 *     rtos_osResumeAllTasksByPriority
 *     rtos_suspendAllTasksByPriority
 *     rtos_resumeAllTasksByPriority
 *
 *   System call interface:
 *
 *     rtos_systemCall
 *     rtos_osSystemCallBadArgument
 *     rtos_checkUserCodeReadPtr (inline)
 *     rtos_checkUserCodeWritePtr
 *
 *   Query system state:
 *
 *     rtos_osGetIdxCore (inline)
 *     rtos_getIdxCore
 *     rtos_getCoreStatusRegister
 *     rtos_osGetAllInterruptsSuspended (inline)
 *     rtos_isProcessSuspended
 *
 *   Diagnostic interface:
 *
 *     rtos_getNoActivationLoss
 *     rtos_getNoTotalTaskFailure
 *     rtos_getNoTaskFailure
 *     rtos_getStackReserve
 *
 * Copyright (C) 2017-2024 Peter Vranken (mailto:Peter_Vranken@Yahoo.de)
 *
 * This program is free software: you can redistribute it and/or modify it
 * under the terms of the GNU Lesser General Public License as published by the
 * Free Software Foundation, either version 3 of the License, or any later
 * version.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE. See the GNU Lesser General Public License
 * for more details.
 *
 * You should have received a copy of the GNU Lesser General Public License
 * along with this program. If not, see <http://www.gnu.org/licenses/>.
 */

/*
 * Include files
 */

#include <stdint.h>
#include <stdbool.h>
#include <stdlib.h>
#include <limits.h>
#include <assert.h>

#include "MPC5748G.h"
#include "typ_types.h"
#include "rtos.config.h"


/*
 * Defines
 */

/** The number of configured processes. The definition is not core specific -- processes
    are shared between cores.\n
      Although it looks like a matter of application dependent configuration, this is a
    fixed setting in our RTOS. We have the HW constraint of a limited number of memory
    region descriptors in MMU and MPU. Four processes can be comfortably supported with
    enough descriptors each. Having less regions per process is possible with reduced
    programming comfort and so we could have more processes even without changing the
    run-time code (i.e. implementation of dynamic change of regions). However, the aimed
    use cases of this RTOS, applications with higher safety integrity level, can be handled
    with two or three processes so that pre-configured four should always be fine.\n
      The big advantage of having a fixed number of processes is the avoidance of
    configuration changes. The MMU and MPU configuration would need changes on C code level
    and the linker script would need more or altered section filters.\n
      No using all pre-configured processes doesn't matter. Just use a process in a task
    specification or leave it. An unused process doesn't produce any overhead. */
#define RTOS_NO_PROCESSES           4

/** The number of cores in the MCU and the maximum number of cores that can run the RTOS.
    If an MCU derivative should have a deviating number of cores then a source code
    migration is required. This is not a variable configuration setting. */
#define RTOS_NO_CORES               3

/** This event ID is returned if creation of a new event is impossible. The ID is unusable,
    no task can be created specifying this event ID. */
#define RTOS_INVALID_EVENT_PROC_ID  (RTOS_MAX_NO_EVENT_PROCESSORS)

/** Deadline monitoring for tasks is supported up to a task maximum execution time of this
    number of Microseconds: (2^31-1)*1e6/f_c, f_c is 80e6 (clock rate of STM timers).\n
      The macro denotes a technical limitation. It is not a configurable item and must not
    be changed. */
#define RTOS_TI_DEADLINE_MAX_IN_US  26843545

/** An RTOS event can normally be triggered by user tasks belonging to a process of
    sufficient privileges. See argument \a minPIDToTriggerThisEvProc of
    rtos_osCreateEventProcessor(). If it should not be accessible even by the process of
    highest privileges than #RTOS_EVENT_PROC_NOT_USER_TRIGGERABLE can be specified for \a
    minPIDToTriggerThisEvProc. */
#define RTOS_EVENT_PROC_NOT_USER_TRIGGERABLE    ((RTOS_NO_PROCESSES)+1u)

/** The number of different kinds of process errors, which let to task abortion. */
#define RTOS_NO_ERR_PRC                 13

/** The enumeration of different kinds of process errors, which lead to task abortion.\n
      Here: Process abort from user/scheduler. */
#define RTOS_ERR_PRC_PROCESS_ABORT      0

/** Kind of process error: Exception IVOR #1, Machine check, mostly memory protection. */
#define RTOS_ERR_PRC_MACHINE_CHECK      1

