PeterVranken/DEVKIT-MPC5748G/samples/safe-RTOS/code/system/RTOS/rtos.h
/** Kind of process error: Task exceeded deadline. */
#define RTOS_ERR_PRC_DEADLINE           2

/** Kind of process error: Exception IVOR #2 or #3, MMU storage error. */
#define RTOS_ERR_PRC_DI_STORAGE         3

/** Kind of process error: Task referred to invalid system call or an existing system call
    has been made with invalid arguments. */
#define RTOS_ERR_PRC_SYS_CALL_BAD_ARG   4

/** Kind of process error: Exception IVOR #5, Alignment. */
#define RTOS_ERR_PRC_ALIGNMENT          5

/** Kind of process error: Exception IVOR #6, mostly illegal instruction. */
#define RTOS_ERR_PRC_PROGRAM_INTERRUPT  6

/** Kind of process error: Exception IVOR #7, Book E FPU instructions. */
#define RTOS_ERR_PRC_FPU_UNAVAIL        7

/** Kind of process error: Exception IVOR #13, TBL data access mismatch. */
#define RTOS_ERR_PRC_TBL_DATA           8

/** Kind of process error: Exception IVOR #14, TBL instr access mismatch. */
#define RTOS_ERR_PRC_TBL_INSTRUCTION    9

/** Kind of process error: Exception IVOR #32, use of SPE instruction. */
#define RTOS_ERR_PRC_SPE_INSTRUCTION    10

/** Kind of process error: User code returned error code. */
#define RTOS_ERR_PRC_USER_ABORT         11

/** Kind of process error: Not yet in use, reserved for extensions. */
#define RTOS_ERR_PRC_RESERVED           12


/** Helper macro for I/O driver implementation. If the driver wants to declare a system
    call then it'll define RTOS_SYSCALL_TABLE_ENTRY_dddd to be
    #RTOS_SC_TABLE_ENTRY(addrOfFct, confClass), where \a dddd is the decimal representation
    of the system call index, \a addrOfFct is the address of the handler, which implements
    the system call, and \a confClass its conformance class.
      @param addrOfFct Address of handler implementation
      @param confClass One out of BASIC (see #RTOS_HDLR_CONF_CLASS_BASIC), SIMPLE (see
    #RTOS_HDLR_CONF_CLASS_SIMPLE) or FULL (see #RTOS_HDLR_CONF_CLASS_FULL) */
#define RTOS_SC_TABLE_ENTRY(addrOfFct, confClass)                       \
            { .addressOfFct = (uint32_t)addrOfFct                       \
            , .conformanceClass = RTOS_HDLR_CONF_CLASS_##confClass      \
            }

/** Helper for data initialization: Task time budgets are internally represented in STM
    counter ticks. Using this macro one can specify it more conveniently in Milliseconds.
    The macro just converts its argument from Milliseconds to clock ticks. */
/// @todo We need a compile-time consistency check of this macro that uses a literal. The check shall compare the macro with the "official" macros in module ccl_configureClocks
#define RTOS_TI_MS2TICKS(tiInMs) ((tiInMs)*80000u)

/** Helper for data initialization: Task time budgets are internally represented in STM(0)
    counter ticks. Using this macro one can specify it more conveniently in Microseconds. The
    macro just converts its argument from Microseconds to clock ticks. */
/// @todo We need a compile-time consistency check of this macro that uses a literal. The check shall compare the macro with the "official" macros in module ccl_configureClocks
#define RTOS_TI_US2TICKS(tiInUs) ((tiInUs)*80u)

/** Index of core Z4 A or value of read-only register PIR on this core and return value of
    function rtos_osGetIdxCore() if called from this core. */
#define RTOS_CORE_Z4A   0u

/** Index of core Z4 B or value of read-only register PIR on this core and return value of
    function rtos_osGetIdxCore() if called from this core. */
#define RTOS_CORE_Z4B   1u

/** Index of core Z2 or value of read-only register PIR on this core and return value of
    function rtos_osGetIdxCore() if called from this core. */
#define RTOS_CORE_Z2    2u

/** \cond Two nested macros are used to convert a constant expression to a string which can
    be used e.g. as part of some inline assembler code.\n
      If for example PI is defined to be (355/113) you could use STR(PI) instead of
    "(355/113)" in the source code. ARG2STR is not called directly. */
#define ARG2STR(x) #x
#define STR(x) ARG2STR(x)
/** \endcond */

/** @todo Consider switching the next code block off to find deprecated code locations,
    which require migration. */
#if 0
/** Backward compatibility: An alias of rtos_osCreateEventProcessor() allows using the
    formerly used name rtos_osCreateEvent() of this API.
      @note The use of this alias name is deprecated. Use rtos_osCreateEventProcessor()
    instead! */
#define rtos_osCreateEvent( pEventId                                                        \
                          , tiCycleInMs                                                     \
                          , tiFirstActivationInMs                                           \
                          , priority                                                        \
                          , minPIDToTriggerThisEvent                                        \
                          , taskParam                                                       \
                          )                                                                 \
    rtos_osCreateEventProcessor( /*pEvProcId*/ (pEventId)                                   \
                               , (tiCycleInMs)                                              \
                               , (tiFirstActivationInMs)                                    \
                               , (priority)                                                 \
                               , /*minPIDToTriggerThisEvProc*/ (minPIDToTriggerThisEvent)   \
                               , /*useCountableEvents*/ false                               \
                               , (taskParam)                                                \
                               )

/** Backward compatibility: An alias of rtos_osSendEvent() allows using the formerly used
    name rtos_osTriggerEvent() of this API.
      @note The use of this alias name is deprecated. Use rtos_osSendEvent() instead! */
# define rtos_osTriggerEvent(idEvent, taskParam)    rtos_osSendEvent(idEvent, taskParam)

/** Backward compatibility: An alias of rtos_sendEvent() allows using the formerly used
    name rtos_triggerEvent() of this API.
      @note The use of this alias name is deprecated. Use rtos_sendEvent() instead! */
# define rtos_triggerEvent(idEvent, taskParam)      rtos_sendEvent(idEvent, taskParam)

/** Backward compatibility: An alias of #RTOS_EVENT_PROC_NOT_USER_TRIGGERABLE allows using
    the formerly used name RTOS_EVENT_NOT_USER_TRIGGERABLE of this macro.
      @note The use of this alias name is deprecated. Use
    #RTOS_EVENT_PROC_NOT_USER_TRIGGERABLE instead! */
# define RTOS_EVENT_NOT_USER_TRIGGERABLE            (RTOS_EVENT_PROC_NOT_USER_TRIGGERABLE)
#endif
/*
 * Global type definitions
 */

/** Type of a single interrupt service as registered with function
    rtos_osRegisterInterruptHandler(). */
typedef void (*rtos_interruptServiceRoutine_t)(void);


/** This enumeration collects the errors, which are recognized during system configuration
    and initialization. */
typedef enum rtos_errorCode_t
{
    rtos_err_noError = 0        /// Not an error, function cuceeded
    , rtos_err_tooManyEventsCreated /// Can't create no more than #RTOS_MAX_NO_EVENT_PROCESSORS events
    , rtos_err_invalidEventPrio /// Priority needs to be in range [1; #RTOS_MAX_LOCKABLE_TASK_PRIORITY)
    , rtos_err_badEventTiming   /// Inconsistent or bad timing configuration stated for event
    , rtos_err_eventNotTriggerable  /// Bad configuration makes event unusable
    , rtos_err_configurationOfRunningKernel /// Attempt to (re-)configure a running kernel
    , rtos_err_badEventProcId   /// The ID of the event is invalid. No such event exists
    , rtos_err_badCountableTimerEventMask   /// Invalid mask specified for a countable timer event
    , rtos_err_badProcessId     /// The ID of the process is invalid. No such process exists
    , rtos_err_tooManyTasksRegistered   /// More than #RTOS_MAX_NO_TASKS registered
    , rtos_err_noEvOrTaskRegistered /// No event and/or no task defined at start of system
    , rtos_err_evProcWithoutTask    /// A useless event exists, which has no task to activate
    , rtos_err_badTaskFunction  /// Bad task function NULL specified
    , rtos_err_taskBudgetTooBig     /// Task budget greater than #RTOS_TI_DEADLINE_MAX_IN_US
    , rtos_err_initTaskRedefined /// Attempt to redefine an already defined initialization task
    , rtos_err_initTaskFailed /// Process initialization function failed or returned neg. value
    , rtos_err_prcStackInvalid  /// Configured stack misaligned or too small
    , rtos_err_taskBelongsToInvalidPrc  /// Task assigned to not configured process
    , rtos_err_highPrioTaskInLowPrivPrc /// Task of highest prio belongs to process of low privileges
    , rtos_err_runTaskBadPermission /// "Unsafe" permissions granted to rtos_runTask()
    , rtos_err_suspendPrcBadPermission/// "Unsafe" permissions granted to rtos_suspendProcess()

    , rtor_err_noErrorCodes

} rtos_errorCode_t;



/** Specification of a task function. Objects of this type are used internally by the
    scheduler for the regularly or event triggered user mode and OS tasks but also visibly
    by the client code, when running a user mode task using rtos_runTask(). */
typedef struct rtos_taskDesc_t
{
    /** Address of task function, which is run in user mode and with process ID \a PID.\n
          Note, the signature of a task function differs. An initialization task and a user
        mode task function can signal an error by return value, while a scheduled OS task
        function can't. A task function started with rtos_runTask() or with
        rtos_osRunTask() has a caller provided argument, which is not available to
        regularly scheduled tasks.\n
          In the assembler code, this field is addressed to by offset O_TCONF_pFct. */
    uintptr_t addrTaskFct;

    /** Time budget for the user task in ticks of the time base (i.e. TBL or STM depending
        on MCU derivative). This budget is granted for each activation of the task. The
        budget relates to deadline monitoring, i.e., it is a world time budget, not an
        execution time budget.\n
          Macros #RTOS_TI_MS2TICKS and #RTOS_TI_US2TICKS can be used to state the time
        budget in Milli- or Mircoseconds.\n
          A value of zero means that deadline monitoring is disabled for the task.\n
          In the assembler code, this field is addressed to by offset O_TCONF_tiMax. */
    uint32_t tiTaskMax;

    /** The process ID of the userTask in the range 1..#RTOS_NO_PROCESSES (PID 0 is reserved
        for kernel operation). At the same time index into the array of process
        descriptors.\n
          In the assembler code, this field is addressed to by offset O_TCONF_pid. */
    uint8_t PID;

} rtos_taskDesc_t;


