PeterVranken/DEVKIT-MPC5748G/samples/safe-RTOS/code/system/RTOS/rtos.h
/*
 * Global data declarations
 */


/*
 * Global prototypes
 */

/** Creation of an event processor. The event processor can use cyclic time triggering or
    be triggerd by software. */
rtos_errorCode_t rtos_osCreateEventProcessor( unsigned int *pEvProcId
                                            , unsigned int tiCycleInMs
                                            , unsigned int tiFirstActivationInMs
                                            , unsigned int priority
                                            , unsigned int minPIDToTriggerThisEvProc
                                            , bool timerUsesCountableEvents
                                            , uint32_t timerTaskTriggerParam
                                            );

/** Creation of an event processor, which is intended for software notified events only. */
rtos_errorCode_t rtos_osCreateSwTriggeredEventProcessor( unsigned int *pEvProcId
                                                       , unsigned int priority
                                                       , unsigned int minPIDToTriggerThisEvProc
                                                       );

/** Task registration for user mode or operating system initialization task. */
rtos_errorCode_t rtos_osRegisterInitTask( int32_t (*initTaskFct)(uint32_t PID)
                                        , unsigned int PID
                                        , unsigned int tiMaxInUs
                                        );

/** Task registration for scheduled user mode tasks. */
rtos_errorCode_t rtos_osRegisterUserTask( unsigned int idEventProc
                                        , int32_t (*userModeTaskFct)( uint32_t PID
                                                                    , uint32_t taskParam
                                                                    )
                                        , unsigned int PID
                                        , unsigned int tiMaxInUs
                                        );

/** Task registration for scheduled operating system tasks. */
rtos_errorCode_t rtos_osRegisterOSTask( unsigned int idEventProc
                                      , void (*osTaskFct)(uint32_t taskParam)
                                      );

/** Initialize the interrupt controller INTC. */
void rtos_osInitINTCInterruptController(void);

/** Install an interrupt service for a given I/O device. */
void rtos_osRegisterInterruptHandler( rtos_interruptServiceRoutine_t interruptServiceRoutine
                                    , unsigned int processorID
                                    , unsigned int vectorNum
                                    , unsigned int psrPriority
                                    , bool isPreemptable
                                    );

/** Grant permission to particular processes for using the service rtos_runTask(). */
void rtos_osGrantPermissionRunTask(unsigned int pidOfCallingTask, unsigned int targetPID);

/**
 * Operating system initialization function: Grant permissions for using the service
 * rtos_suspendProcess() to particular processes. By default, the use of that service is not
 * allowed.\n
 *   By principle, offering service rtos_suspendProcess() makes all processes vulnerable,
 * which are allowed as target for the service. A failing, straying process can always hit
 * some ROM code executing the system call with arbitrary register contents, which can then
 * lead to immediate task abortion in and suspension of an otherwise correct process.\n
 *   This does not generally break the safety concept, the potentially harmed process can
 * for example be anyway supervised by another, non-suspendable supervisory process.
 * Consequently, we can offer the service at least on demand. A call of this function
 * enables the service for a particular pair of calling process and targeted process.
 *   @param pidOfCallingTask
 * The tasks belonging to process with PID \a pidOfCallingTask are granted permission to
 * suspend another process. The range is 1 .. #RTOS_NO_PROCESSES, which is double-checked by
 * assertion.
 *   @param targetPID
 * The process with PID \a targetPID is suspended. The range is 1 .. maxPIDInUse-1, which is
 * double-checked later.
 *   @remark
 * It would break the safety concept if we permitted the process with highest privileges to
 * become the target of the service. This is double-checked not here (when it is not yet
 * defined, which particular process that will be) but as part of the RTOS startup
 * procedure; a bad configuration can therefore lead to a later reported run-time error.
 *   @remark
 * This function must be called from the OS context only. It is intended for use in the
 * operating system initialization phase. It is not reentrant. The function needs to be
 * called prior to rtos_osInitKernel().
 */
void rtos_osGrantPermissionSuspendProcess( unsigned int pidOfCallingTask
                                         , unsigned int targetPID
                                         );

/** Kernel initialization. */
rtos_errorCode_t rtos_osInitKernel(void);

/** Software triggered task activation. Can be called from OS context (incl. interrupts). */
bool rtos_osSendEvent(unsigned int idEventProc, uint32_t taskParam);

/** Software triggered task activation with countable event. Can be called from OS context
    (incl. interrupts). */
bool rtos_osSendEventCountable(unsigned int idEventProc, uint32_t evMask);

/** Software triggered task activation with more than one occurance of a countable event.
    Can be called from OS context (incl. interrupts). */
bool rtos_osSendEventMultiple(unsigned int idEventProc, uint32_t evMask, uint8_t count);

/** Enter critical section; partially suspend task scheduling. */
uint32_t rtos_osSuspendAllTasksByPriority(uint32_t suspendUpToThisTaskPriority);

/** Leave critical section; resume scheduling of tasks. */
void rtos_osResumeAllTasksByPriority(uint32_t resumeDownToThisTaskPriority);

/**
 * Priority ceiling protocol, partial scheduler lock: All tasks up to the specified task
 * priority level won't be served by the CPU. This function is intended for implementing
 * mutual exclusion of sub-sets of tasks: Call it with the highest priority of all tasks,
 * which should be locked, i.e. which compete for the resource or critical section to
 * protect. This may still lock other, not competing tasks, but at least all non competing
 * tasks of higher priority and the interrupt handlers will still be served.\n
 *   To release the protected resource or to leave the critical section, call the
 * counterpart function rtos_resumeAllTasksByPriority(), which restores the original
 * task priority level.\n
 *   The priority can be raised only up to #RTOS_MAX_LOCKABLE_TASK_PRIORITY. An attempt to
 * raise it beyond this limit will lead to an #RTOS_ERR_PRC_SYS_CALL_BAD_ARG exception.\n
 *   Safety rationale: A user task cannot shape a critical section with the RTOS scheduler,
 * nor with the user task of priority above #RTOS_MAX_LOCKABLE_TASK_PRIORITY and nor with
 * an ISR. (The attempt to shape a critical section with a task above
 * #RTOS_MAX_LOCKABLE_TASK_PRIORITY is caught in DEBUG compilation, see
 * rtos_resumeAllTasksByPriority().) The intention is to inhibit a task from blocking a
 * safety task.
 *   @return
 * Get the task priority level at entry into this function (and into the critical section).
 * This priority level needs to be restored on exit from the critical section using system
 * call rtos_resumeAllTasksByPriority().
 *   @param suspendUpToThisPriority
 * \a suspendUpToThisPriority is the aimed task priority level. All tasks up to and
 * including this priority will be locked. They won't get the CPU until the priority level
 * is lowered again.
 *   @remark
 * The critical section shaped with this API from an user mode task guarantees mutual
 * exclusion with critical section code shaped with the other API
 * rtos_osSuspendAllTasksByPriority() from an OS task.
 *   @remark
 * To support the use case of nested calls of OSEK/VDX like GetResource/ReleaseResource
 * functions, this function compares the stated value to the current task priority level.
 * If \a suspendUpToThisPriority is less than the current value then the current value is
 * not altered. The function still returns the current value and the calling code doesn't
 * need to take care: It can unconditionally end a critical section with
 * rtos_resumeAllTasksByPriority() stating the returned task priority level value. (The
 * resume function will have no effect in this case.) This makes the OSEK like functions
 * usable without deep inside or full transparency of the priority levels behind the scene;
 * just use the pairs of Get-/ResumeResource, be they nested or not.
 *   @remark
 * The expense in terms of CPU consumption of using this function is significant enough to
 * better avoid nested pairs of Get-/ResumeResource. As long as all resource and task
 * relationships are static, it'll be possible to replace nested pairs of function calls
 * by a single one with combined, maximum priority.
 *   @remark
 * The use of this function to implement critical sections is usually quite static. For any
 * protected entity (usually a data object or I/O device) the set of competing tasks
 * normally is a compile time known. The priority level to set for entry into the critical
 * section is the maximum of the priorities of all tasks in the set. The priority level to
 * restore on exit from the critical section is the priority of the calling task. All of
 * this static knowledge would typically be put into encapsulating macros that actually
 * invoke this function. (OSEK/VDX like environments would use this function pair to
 * implement the GetResource/ReleaseResource concept.)
 *   @remark
 * The raised priority is implicitly restored at the end of the task. It is not possible to
 * consider this function a mutex, which can be acquired in one task activation and which
 * can be released in an arbitrary later task activation or from another task.
 *   @remark
 * This function must be called from the user task context only. Any attempt to use it from
 * OS code will lead to a crash.
 */
uint32_t rtos_suspendAllTasksByPriority(uint32_t suspendUpToThisPriority);


/**
 * This function is called to end a critical section of code, which requires mutual
 * exclusion of two or more tasks. It is the counterpart of function
 * rtos_suspendAllTasksByPriority(), refer to that function for more details.\n
 *   The priority can be lowered only down to the initial task priority. An attempt to
 * lower it below the initial task priority will lead to an #RTOS_ERR_PRC_SYS_CALL_BAD_ARG
 * exception.
 *   @param resumeDownToThisPriority
 * All tasks above this task priority level are resumed again. All tasks up to and
 * including this task priority remain locked.\n
 *   The intended use of this function is to restore the priority level of a task after use
 * of a resource, which had been protected by an earlier call of the counterpart function
 * rtos_suspendAllTasksByPriority(). Normally, \a resumeDownToThisPriority will be set
 * to the value returned by the other function (or by a constant since this value is a
 * compile-time known in most use cases).
 *   @remark
 * To support the use case of nested calls of OSEK/VDX like GetResource/ReleaseResource
 * functions, this function compares the stated prioity value to the current priority
 * level. If \a resumeDownToThisPriority is greater than the current value then the current
 * value is not altered.
 *   @remark
 * It is impossible to shape a critical section with the safety task of priority above
 * #RTOS_MAX_LOCKABLE_TASK_PRIORITY and the attempt will always mean a functional error in
 * the design of the application code. To support debugging, this error is caught in DEBUG
 * compilation: Then the function throws a #RTOS_ERR_PRC_SYS_CALL_BAD_ARG exception if \a
 * resumeDownToThisPriority is greater than #RTOS_MAX_LOCKABLE_TASK_PRIORITY. In PRODUCTION
 * compilation, we have the normal behavior of silently ignoring attempts to actually raise
 * the priority.
 *   @remark
 * Besides the likely unwanted impact on the scheduling, it doesn't harm if a user task
 * calls rtos_suspendAllTasksByPriority() to raise the priority but doesn't lower it
 * later using this function. The effect of rtos_suspendAllTasksByPriority() will end
 * with the termination of the task. If a critical section is required at the end of a task
 * function it may even be advantageous to not call rtos_resumeAllTasksByPriority() in
 * order to save the overhead of the involved system call.
 *   @remark
 * Due to the task switch it can initiate, this function is implemented as a system call of
 * full conformance class and this means significant overhead. It should be applied with
 * care for frequently acquired resources or for very short critical sections.\n
 *   Alternatives are: Look-free programming techniques or dedicated system calls for the
 * given purpose.
 *   @remark
 * This function must be called from the user task context only. Any attempt to use it from
 * OS code will lead to a crash.
 */
void rtos_resumeAllTasksByPriority(uint32_t resumeDownToThisPriority);


/**
 * System call; entry point into operating system function for user code.
 *   @return
 * The return value depends on the system call.
 *   @param idxSysCall
 * Each system call is identified by an index. The index is an unsigned integer. The number
 * is the index into system call descriptor table \a rtos_systemCallDescAry.\n
 *   See manual,
 * https://github.com/PeterVranken/TRK-USB-MPC5643L/blob/master/LSM/safe-RTOS-VLE/doc/manual/manual.pdf,
 * section System calls of RTOS, Table 1, p. 17, for a list of system calls offered by the
 * RTOS kernel. More system calls will be offered by your operating system, which builds on
 * safe-RTOS, please refer to your device driver documentation.\n
 *   The further function arguments depend on the particular system call.
 *   @param ...
 * The remaining arguments are passed register based to the system call implementation.
 * "Register based" means that the number of arguments is restricted to 7 values of 8..32
 * Bit each or accordingly lesser arguments if 64 Bit arguments are in use that require
 * two registers each.
 *   @remark
 * It depends on the particular system call, which context this function may be called
 * from. Nearly all system calls will be restricted to be called from user code. Only a few,
 * like the assert function, are accessible from operating system code, too. Please, refer
 * to the documentation of the particular system call.
 *   @remark
 * The C signature for system calls is formally not correct. The assembly code, which
 * implements this function, only supports function arguments in CPU registers, which
 * limits the total number to eight. The ... stands for 0..7 arguments of up to 32 Bit. If
 * a system call function has more arguments or if it are 64 Bit arguments then the
 * assembly code may not propagate all arguments properly to the actually implementing
 * system call handler and the behavior will be undefined!
 */
uint32_t rtos_systemCall(uint32_t idxSysCall, ...);


