PeterVranken/DEVKIT-MPC5748G/samples/safe-RTOS/code/system/RTOS/rtos.h
/** Check if a pointer value is valid for writing in the context of a given process. */
bool rtos_checkUserCodeWritePtr(unsigned int PID, const void *address, size_t noBytes);

/**
 * C signature for an assembly code entry point, which ends a system call handler with user
 * task termination and counted process error. Must be used solely from within the
 * implementation of a system call and only if the abortion is due to a clear fault in the
 * calling user code.
 */
_Noreturn void rtos_osSystemCallBadArgument(void);


/** Get the current number of failed event triggers since start of the RTOS scheduler. */
unsigned int rtos_getNoActivationLoss(unsigned int idEventProc);

/** Get the number of task failures counted for the given process since start of the kernel. */
unsigned int rtos_getNoTotalTaskFailure(unsigned int PID);

/** Get the number of task failures of given category for the given process. */
unsigned int rtos_getNoTaskFailure(unsigned int PID, unsigned int kindOfErr);

/** How many bytes of the stack area of a process are still unused on the calling core? */
unsigned int rtos_getStackReserve(unsigned int PID);

/** Kernel function to suspend a process. */
void rtos_osSuspendProcess(uint32_t PID);

/** Kernel function to read the suspend status of a process. */
bool rtos_isProcessSuspended(uint32_t PID);

/**
 *   @func rtos_getIdxCore
 * This function returns the contents of CPU read-only register PIR.
 *   @return
 * Get the index of the core the calling code is running on. The range is 0..2, meaning
 * Z4A, Z4B, Z2, respectively. (The convenience macros #RTOS_CORE_Z4A,  #RTOS_CORE_Z4B
 * and #RTOS_CORE_Z2 can be used.)
 *   @remark
 * This function may be called from all contexts. However, OS contexts shouldn't because of
 * the performance penalty. They should only use the intrinsic rtos_osGetIdxCore() instead.
 */
unsigned int rtos_getIdxCore(void);


/**
 *   @func rtos_getCoreStatusRegister
 * Get the value of the msr. This is an entry point to C code, which can be called from
 * supervisor and user mode.
 *   @return
 * Get the current contents of CPU register MSR on the code executing core.
 *   @remark
 * This function can be called from OS and user code. OS code should however better use an
 * intrinsic to read the MSR and in order to save the function call overhead.
 */
uint32_t rtos_getCoreStatusRegister(void);



/*
 * Inline functions
 */

/**
 * This function returns the content of the read-only CPU register PIR.
 *   @return
 * Get the zero based index of the core the calling code is excuted on. The range depends
 * on the derivative of the MCU.\n
 *   The convenience macros #RTOS_CORE_Z4A,  #RTOS_CORE_Z4B and #RTOS_CORE_Z2 can be used
 * to evaluate the function result.
 *   @remark
 * This function may be called from all supervisor contexts, i.e. OS tasks and ISRs. A call
 * from a user task will cause an exception.
 */
static inline unsigned int rtos_osGetIdxCore(void)
{
#define RTOS_SPR_PIR 286 /* SPR index of PIR. */

    uint32_t idxCore;
    asm volatile ( /* AssemblerTemplate */
                   "mfspr   %0, " STR(RTOS_SPR_PIR) "\n\t"
                 : /* OutputOperands */ "=r" (idxCore)
                 : /* InputOperands */
                 : /* Clobbers */
                 );
    return (unsigned int)idxCore;

} /* End of rtos_osGetIdxCore */



/**
 * Start a user task. A user task is a C function, which is executed in user mode and in a
 * given process context. The call is synchronous; the calling OS context is immediately
 * preempted and superseded by the started task. The calling OS context is resumed when the
 * task function ends - be it gracefully or by exception/abortion.\n
 *   The started task inherits the priority of the calling OS context. It can be preempted
 * only by contexts of higher priority.
 *   @return
 * The executed task function can return a value, which is propagated to the calling OS
 * context if it is positive. A returned negative task function result is interpreted as
 * failing task and rtos_osRunTask() returns #RTOS_ERR_PRC_USER_ABORT instead.
 * Furthermore, this event is counted as process error in the target process.
 *   @param pUserTaskConfig
 * The read-only configuration data for the task. In particular the task function pointer
 * and the ID of the target process.
 *   @param taskParam
 * This argument is meaningless to the function. The value is just passed on to the started
 * task function. The size is large enough to convey a pointer.
 *   @remark
 * This function must be called from the OS context only. Any attempt to use it in user
 * code will lead to a privileged exception.
 *   @remark
 * The function is intended to implement safe user code callbacks from interrupt events.
 * However, deadline monitoring fails for the task execution if the ISR, which makes use of
 * this API has a priority equal to or above the kernel priority
 * #RTOS_KERNEL_IRQ_PRIORITY_CORE_0 (or #RTOS_KERNEL_IRQ_PRIORITY_CORE_1, or
 * #RTOS_KERNEL_IRQ_PRIORITY_CORE_2, if the RTOS is running on core 1 or 2, respectively).
 * This would likely break the aimed safety concept; an infinite loop in the user code could
 * make the system hang. In most situations, a reasonable safety requirement will prohibit
 * the use of this function from any ISR with such a high priority.
 */
static inline int32_t rtos_osRunTask( const rtos_taskDesc_t *pUserTaskConfig
                                    , uint32_t taskParam
                                    )
{
    /* The function is assembler implemented, the C function is just a wrapper for
       convenient calling within the expected namespace. Direct calling of the assembly
       code function is unwanted because of the name: In the assembler module the name "run
       user task" makes sense but for the user of the RTOS it doesn't: To him there is no
       distinction of starting either OS or user tasks, all tasks he knows are "user
       tasks". */
    extern int32_t rtos_osRunUserTask(const struct rtos_taskDesc_t *, uint32_t);
    return rtos_osRunUserTask(pUserTaskConfig, taskParam);

} /* End of rtos_osRunTask */



/**
 * Start a user task. A user task is a C function, which is executed in user mode and in a
 * given process context. The call is synchronous; the calling user context is immediately
 * preempted and superseded by the started task. The calling user context is resumed when the
 * task function ends - be it gracefully or by exception/abortion.\n
 *   The started task inherits the priority of the calling context. It can be preempted
 * only by contexts of higher priority.\n
 *   The function requires sufficient privileges. See rtos_osGrantPermissionRunTask() for
 * details. The task cannot be started in the OS context.\n
 *   The function cannot be used recursively. The created task cannot in turn make use of
 * rtos_runTask().
 *   @return
 * The executed task function can return a value, which is propagated to the calling user
 * context if it is positive. A returned negative task function result is interpreted as
 * failing task and rtos_runTask() returns #RTOS_ERR_PRC_USER_ABORT instead.
 * Furthermore, this event is counted as process error in the target process.
 *   @param pUserTaskConfig
 * The read-only configuration data for the task. In particular the task function pointer
 * and the ID of the target process.
 *   @param taskParam
 * This argument is meaningless to the function. The value is just passed on to the started
 * task function. The size is large enough to convey a pointer.
 *   @remark
 * This function must be called from a user process context only. Any attempt to use it in
 * supervisor code will lead to a crash.
 */
static inline int32_t rtos_runTask( const rtos_taskDesc_t *pUserTaskConfig
                                  , uint32_t taskParam
                                  )
{
    #define RTOS_IDX_SC_RUN_TASK    4
    return (int32_t)rtos_systemCall(RTOS_IDX_SC_RUN_TASK, pUserTaskConfig, taskParam);

