PeterVranken/DEVKIT-MPC5748G/samples/safe-RTOS/code/system/RTOS/rtos.h
} /* End of rtos_runTask */



/**
 * End/abort the calling task immediately. A user task may use this system call at any time
 * and from any nested sub-routine. The task execution is immediately aborted. The function
 * does not return.
 *   @param taskReturnValue
 * The task can return a value to its initiator, i.e. to the context who had applied
 * rtos_osRunTask() or rtos_runTask() to create the task. The value is signed and (only)
 * the sign is meaningful to the assembly code to create/abort a task:\n
 *   The requested task abortion is considered an error and counted in the owning process
 * if the returned value is negative. In this case, the calling context won't receive the
 * value but the error code #RTOS_ERR_PRC_USER_ABORT.\n
 *   The requested task abortion is not considered an error if \a taskReturnValue is
 * greater or equal to zero. The value is propagated to the task creating context.
 *   @remark
 * If the function is called from inside a critical section, which had been started using
 * rtos_suspendAllTasksByPriority(), then the critical section is implicitly ended by
 * this function call.
 *   @remark
 * This function must be called from the user task context only. Any attempt to use it from
 * OS code will lead to a crash. There's no equivalent of this function for OS code. An OS
 * task can't be ended prematurely.
 */
static inline _Noreturn void rtos_terminateTask(int32_t taskReturnValue)
{
    extern _Noreturn void rtos_terminateUserTask(int32_t);
    rtos_terminateUserTask(taskReturnValue);

} /* End of rtos_terminateTask */



/**
 * Disable all External Interrupts. This is done unconditionally, there's no nesting
 * counter.
 *   @remark Note, suspending all External Interrupts does not affect all other interrupts
 * (effectively CPU traps), like Machine Check interrupt.
 *   @remark
 * This function must be called from the OS context only. Any attempt to use it in user
 * code will lead to a privileged exception.
 */
static ALWAYS_INLINE void rtos_osSuspendAllInterrupts(void)
{
    /* The completion synchronizing character of the wrteei instruction forms the memory
       barrier, which ensures that all memory operations before the now entered critical
       section are completed before we enter (see core RM, 4.6.1, p. 151). The "memory"
       constraint ensures that the compiler won't reorder instructions from behind the
       wrteei to before it. */
    asm volatile ( /* AssemblerTemplate */
                   "wrteei 0\n"
                 : /* OutputOperands */
                 : /* InputOperands */
                 : /* Clobbers */ "memory"
                 );
} /* End of rtos_osSuspendAllInterrupts */



/**
 * Enable all External Interrupts. This is done unconditionally, there's no nesting
 * counter.
 *   @remark
 * This function must be called from the OS context only. Any attempt to use it in user
 * code will lead to a privileged exception.
 *   @remark
 * This function can be called even from non safe-RTOS applications if they run in
 * supervisor mode.
 */
static ALWAYS_INLINE void rtos_osResumeAllInterrupts(void)
{
    /* The completion synchronizing character of the wrteei instruction forms the memory
       barrier, which ensures that all memory operations inside the now left critical
       section are completed before we leave (see core RM, 4.6.1, p. 151). The "memory"
       constraint ensures that the compiler won't reorder instructions from before the
       wrteei to behind it. */
    asm volatile ( /* AssemblerTemplate */
                   "wrteei 1\n"
                 : /* OutputOperands */
                 : /* InputOperands */
                 : /* Clobbers */ "memory"
                 );
} /* End of rtos_osResumeAllInterrupts */




/**
 * Get the current state of the MSR[EE] status bit.
 *   @return
 * Get \a true if the processing of External Interrupts is currently enabled and \a false
 * otherwise.
 *   @remark
 * This function must be used from OS tasks and ISRs only. Calling it from a user task will
 * cause a privileged instruction exception and an error is counted for the process.
 *   @remark
 * This function can be called even from non safe-RTOS applications if they run in
 * supervisor mode.
 */
static ALWAYS_INLINE bool rtos_osGetAllInterruptsSuspended(void)
{
    uint32_t msr;
    asm volatile ( /* AssemblerTemplate */
                   "mfmsr %0\n\t"
                 : /* OutputOperands */ "=r" (msr)
                 : /* InputOperands */
                 : /* Clobbers */ "memory"
                 );
    return (msr & 0x00008000) == 0;

} /* End of rtos_osGetAllInterruptsSuspended */



/**
 * Start the code of a critical section, thus code, which operates on data, that must not
 * be touched from another execution context at the same time.\n
 *   The critical section is implemented by globally disabling all interrupts.
 *   @return
 * The machine status register content of before disabling the interrupts is returned. The
 * caller will safe it and pass it back to rtos_osLeaveCriticalSection() at the end of the
 * critical section. This way the nestability is implemented.
 *   @remark
 * The main difference of this function in comparison to rtos_osSuspendAllInterrupts() is the
 * possibility to nest the calls at different hierarchical code sub-function levels.
 *   @remark
 * This function must be called from the OS context only. Any attempt to use it in user
 * code will lead to a privileged exception.
 *   @remark
 * This function can be called even from non safe-RTOS applications if they run in
 * supervisor mode.
 */
static ALWAYS_INLINE uint32_t rtos_osEnterCriticalSection(void)
{
    /* The completion synchronizing character of the mfmsr instruction forms the memory
       barrier, which ensures that all memory operations before the now entered critical
       section are completed before we enter (see core RM, 4.6.1, p. 151). The "memory"
       constraint ensures that the compiler won't reorder instructions from behind the
       wrteei to before it. */
    uint32_t msr;
    asm volatile ( /* AssemblerTemplate */
                   "mfmsr %0\n\t"
                   "wrteei 0\n\t"
                 : /* OutputOperands */ "=r" (msr)
                 : /* InputOperands */
                 : /* Clobbers */ "memory"
                 );
    return msr;

} /* End of rtos_osEnterCriticalSection */



/**
 * End the code of a critical section, thus code, which operates on data, that must not
 * be touched from another execution context at the same time.\n
 *   The critical section is implemented by globally disabling all interrupts.
 *   @param msr
 * The machine status register content as it used to be at entry into the critical section.
 * See rtos_osEnterCriticalSection() for more.
 *   @remark
 * This function must be called from the OS context only. Any attempt to use it in user
 * code will lead to a privileged exception.
 *   @remark
 * This function can be called even from non safe-RTOS applications if they run in
 * supervisor mode.
 */
static ALWAYS_INLINE void rtos_osLeaveCriticalSection(uint32_t msr)
{
    /* The completion synchronizing character of the wrtee instruction forms the memory
       barrier, which ensures that all memory operations inside the now left critical
       section are completed before we leave (see core RM, 4.6.1, p. 151). The "memory"
       constraint ensures that the compiler won't reorder instructions from before the
       wrtee to behind it. */
    asm volatile ( /* AssemblerTemplate */
                   "wrtee %0 /* Restore MSR[EE] */\n\t"
                 : /* OutputOperands */
                 : /* InputOperands */ "r" (msr)
                 : /* Clobbers */ "memory"
                 );
} /* End of rtos_osLeaveCriticalSection */



/**
 * Notify an event to an event processor to let it activate all associated tasks.\n
 *   This function must only be called from user tasks, which belong to a process with
 * sufficient privileges. The operation is permitted only for tasks belonging to those
 * processes, which have an ID that is greater of equal to the minimum specified for the
 * event in question. Otherwise an exception is raised, which aborts the calling task.\n
 *   If the calling task belongs to the set of tasks associated with \a idEventProc, then
 * it'll have no effect but a recorded activation loss; an event processor can re-triggered
 * only after all associated activations have been completed. There is no activation
 * queuing. The function returns \a false in this case.\n
 *   Note, the system respects the priorities of the activated tasks. If a task of priority
 * higher than the activating task is activated by the triggered event processor then the
 * activating task is immediately preempted to the advantage of the activated task.
 * Otherwise the activated task is chained and executed after the activating task.
 *   @return
 * There is no activation queuing. Consequently, notifying the event can fail if at least
 * one of the associated tasks has not yet completed after the previous trigger of the
 * event. The function returns \a false and the activation loss counter of the event
 * processor is incremented. (See rtos_getNoActivationLoss().) In this situation, the new
 * trigger is entirely lost, i.e., none of the associated tasks will be activated by the
 * event and \a the value of taskParam won't be seen by the task functions.
 *   @param idEventProc
 * The ID of the event processor to activate as it had been got by the creation call for
 * that processor. (See rtos_osCreateEventProcessor() and
 * rtos_osCreateSwTriggeredEventProcessor().)
 *   @param taskParam
 * All associated tasks will receive this value, when they are called because of this
 * trigger.\n
 *   The value is ignored if the function returns \a false.
 *   @remark
 * The function is indented to start a non periodoc task by application software trigger
 * but can be applied to periodic timer tasks, too. In which case the task function of the
 * cyclic task would be invoked once additionally. Note, that an event activation loss is
 * not unlikely in this case; the cyclic task may currently be busy. For this purpose, the
 * use of countable events is probably the better choice. See rtos_osSendEventCountable().
 *   @remark
 * Events notified with this API is called "ordinary". In most situations, the use of
 * countable events will perform better, see rtos_osSendEventCountable(). An important
 * exception from this are timer events for ordinary periodic tasks.
 *   @remark
 * It may look like an inconsistent API design if all associated tasks receive the same
 * value \a taskParam. The service could easily offer an API, which provides an individual
 * value to each associated task. The only reason not to do so is the additional overhead
 * in combination with the very few imaginable use cases. In most cases an explicitly
 * triggered event will have just one associated task; events with more than one task will
 * mostly be regular timer tasks, which make rarely use of the task parameter.
 *   @remark
 * It is not forbidden but useless to let a task activate itself by triggering the event
 * processor it is associated with with this API. This will have no effect besides
 * incrementing the activation loss counter for that event processor.
 *   @remark
 * This function must be called from the user task context only. Any attempt to use it from
 * OS code will lead to a crash.
 */
static inline bool rtos_sendEvent(unsigned int idEventProc, uintptr_t taskParam)
{
    #define RTOS_IDX_SC_SEND_EVENT   3
    return (bool)rtos_systemCall( RTOS_IDX_SC_SEND_EVENT
                                , idEventProc
                                , /* noCountableTriggers */ 0u /* 0: "old style" trigger */
                                , /* evMaskOrTaskParam */ taskParam
                                );
} /* End of rtos_sendEvent */


/**
 * Notify a countable event to activate all associated tasks. Event processors can be used
 * with countable or ordinary events. Please note, the event processor as such is neither
 * countable nor ordinary, but it can be triggered in either way. (For ordinary, see
 * rtos_sendEvent().)\n
 *   For countable events, the multiplicity of notification is recorded and forwarded to
 * the associated task functions by means of their task parameter. Effectively, this is a
 * kind of activation queing, even if it doesn't mean that an associated task is guaranteed
 * to become activated as often as this function is called.\n
 *   Up to a certain maximum, the number of invocations of this function is counted and
 * stored. The stored number is handed over as task parameter to all associated tasks, when
 * they are activated the next time. If the event processor is idle, when this function is
 * called, then the count is one and this is what the task functions will get. If it is not
 * idle then it depends. If the next call(s) of this function happen before the event
 * processor becomes idle again then the stored multiplicity is 2, 3, 4, ... As soon as the
 * event processor becomes idle, its tasks are activated and their task parameter will
 * carry the 2, 3, 4, ..., respectively. In this example, if the event processor becomes
 * idle after 4 calls, then the tasks will be activated not 4 times but just once with a
 * reported multiplicity of 4 triggers. No activation loss is recorded for the event
 * processor, as long as the counter for storing the multiplicity of the triggers doesn't
 * overflow.\n
 *   Using this API for triggering an event, the associated tasks will strictly know, how
 * many notifications of the event occurred - even if the number of task activations may be
 * lesser.\n
 *   Note, the system respects the priorities of the activated tasks. If a task of priority
 * higher than the activating task is activated by the notified event then the activating
 * task is immediately preempted to the advantage of the activated task. Otherwise the
 * activated task is chained and executed after the activating task.
 *   @return
 * Notifying the countable event fails if the counter for the multiplicity of the event
 * overflows. The implementation limit of this counter is determined by the mask \a evMask.
 * If n bits are set in \a evMask then the function may be called up to 2^n-1 times while
 * the event processor is not idle. The 2^n-th call will be first one returning \a false
 * and only now, an activation loss will be recorded for the event processor.\n
 *   As long as the caller gets \a true, he can be sure that the multiplicity of all
 * notifications so far will be properly delivered to the associated task functions.
 *   @param idEventProc
 * The ID of the event processor to activate as it had been got by the creation call for
 * that processor. (See rtos_osCreateEventProcessor() and
 * rtos_osCreateSwTriggeredEventProcessor().)
 *   @param evMask
 * Definition of the bit mask designating the notified event. See above for details.
 *   @remark
 * The function is indented to start a non periodic task by application software trigger
 * but can be applied to periodic timer tasks, too. In which case the task function of the
 * cyclic task would be invoked once additionally. Note, that a non-idle event processor is
 * not unlikely in this case; \a evMask should spent a sufficient number of bits to
 * temporarily store the multiplicity of notifications-while-non-idle.
 *   @remark
 * This function must be called from the user task context only. Any attempt to use it from
 * OS code will lead to a crash.
 */
static inline bool rtos_sendEventCountable(unsigned int idEventProc, uint32_t evMask)
{
    #define RTOS_IDX_SC_SEND_EVENT   3
    return (bool)rtos_systemCall( RTOS_IDX_SC_SEND_EVENT
                                , idEventProc
                                , /* noCountableTriggers */ 1u
                                , /* evMaskOrTaskParam */ evMask
                                );
} /* rtos_sendEventCountable */



/**
 * A countable event can be notified with multiplicity greater than one. If the event
 * processor is idle then the associated tasks are activated and they will receive the
 * multiplicity \a count in their task parameter. If the event processor is not idle then
 * the accumulator for the event will be incremented either by \a count or up to its
 * implementation maximum, whatever comes first. The resulting, accumulated count will be
 * forwarded to the task functions as soon as the processor becomes idle again.
 *   @return
 * Get \a false if the accumulator for the event overflows (and saturates at its maximum).
 * Get \a true otherwise.
 *   @param idEventProc
 * The ID of the event processor to activate as it had been got by the creation call for
 * that processor. (See rtos_osCreateEventProcessor() and
 * rtos_osCreateSwTriggeredEventProcessor().)
 *   @param evMask
 * Definition of the bit mask designating the notified event. See rtos_sendEventCountable()
 * for details.
 *   @param count
 * The notified multiplicity of the event.\n
 *   The complexity of the operation is O(count), which means that it is intended for
 * rather small multiplicities. To avoid undesired blocking of the function due to
 * excessive high multiplicities, the implementation type for the argument has been chosen
 * 8 Bit, which strictly limits the range of \a count to 1..255.\n
 *   \a count = 0 is not allowed and caught by assertion.
 *   @remark
 * The behavior of this function is similar to calling rtos_sendEventCountable() for \a
 * count times. The result of rtos_sendEventMultiple() would then be the result of the
 * very last call of rtos_sendEventCountable().
 *   @remark
 * This function must be called from the user task context only. Any attempt to use it from
 * OS code will lead to a crash.
 */ 
static inline bool rtos_sendEventMultiple(unsigned int idEventProc, uint32_t evMask, uint8_t count)
{
    /* This function must not be used with an increment of zero counts: This is useless and
       therefore internally used as flag to say "old style" trigger, i.e., other behavior
       and deviating interpretation of evMask.
         Note, this situation is not caught by the system call implementation; if it
       happens, it is a "normal" user code error but it doesn't break the safety concept.
       The system call performs without a safety risk, only the user code's behavior will
       be different to what's expected. */
    assert(count > 0u);

