PeterVranken/DEVKIT-MPC5748G/samples/safe-RTOS/code/system/RTOS/rtos.h
    #define RTOS_IDX_SC_SEND_EVENT   3
    return (bool)rtos_systemCall( RTOS_IDX_SC_SEND_EVENT
                                , idEventProc
                                , /* noCountableTriggers */ count
                                , /* evMaskOrTaskParam */ evMask
                                );
} /* rtos_sendEventMultiple */


/**
 * Helper function, mainly intended to support safe system call handler implementation:
 * Check if a pointer value is valid for reading in the context of a given process.\n
 *   A system call handler must never trust a user code provided pointer; evidently not for
 * write access but not even for read operation (a read into the address space of
 * peripherals can have a side effect). The user code could make the system call handler
 * overwrite some non-process owned data objects, cause an access violation in the
 * supervisor code or manipulate some peripherals by side effect of a read-register
 * operation.\n
 *   Normally, it's strongly disencouraged having pointers as arguments of system calls at
 * all. If not avoidable, one can use this helper function to check that a pointer points
 * into permitted address space and that all bytes of a data object pointed at are still in
 * that address space. Here for read access.\n
 *   Permitted address space is anywhere, where supervisor code may read without causing an
 * exception or any kind of side effect. In particular, these are the used portions of RAM
 * and ROM.
 *   @return
 * Get \a true if the pointer may be used for read access and \a false otherwise.
 *   @param address
 * The pointer value, or the beginning of the chunk of memory, which needs to be entirely
 * located in readable memory.
 *   @param noBytes
 * The size of the chunk of memory to be checked. Must not be less than one. (Checked by
 * assertion).
 *   @remark
 * Use the counterpart function rtos_checkUserCodeWritePtr() if a system call handler
 * should do a write access via a user code provided pointer.
 *   @remark
 * Although this function is intended for use inside a system call handler it can be safely
 * used from user code, too.
 */
static inline bool rtos_checkUserCodeReadPtr(const void *address, size_t noBytes)
{
    const uint8_t * const p = (uint8_t*)address;
    extern uint8_t ld_ramStart[0], ld_ramEnd[0], ld_romStart[0], ld_romEnd[0];

    return p >= ld_ramStart  &&  p+noBytes <= ld_ramEnd
           ||  p >= ld_romStart  &&  p+noBytes <= ld_romEnd;

} /* End of rtos_checkUserCodeReadPtr */



/**
 * System call to suspend a process. All currently running tasks belonging to the process
 * are aborted and the process is stopped forever (i.e. there won't be further task starts
 * or I/O driver callback invocations).\n
 *   Suspending a process of PID i is permitted only to processes of PID j>i.
 *   @param PID
 * The ID of the process to suspend. Needs to be not zero (OS process) and lower than the
 * ID of the calling process. Otherwise the calling task is aborted with exception
 * #RTOS_ERR_PRC_SYS_CALL_BAD_ARG.
 *   @remark
 * Tasks of the suspended process can continue running for a short while until their abort
 * conditions are checked the next time. The likelihood of such a continuation is little
 * and the duration is in the magnitude of a Millisecond.
 *   @remark
 * This function must be called from the user task context only. Any attempt to use it from
 * OS code will lead to a crash.
 */
static inline void rtos_suspendProcess(uint32_t PID)
{
    #define RTOS_IDX_SC_SUSPEND_PROCESS     5
    rtos_systemCall(RTOS_IDX_SC_SUSPEND_PROCESS, PID);

} /* End of rtos_suspendProcess */


#endif  /* RTOS_INCLUDED */
